# Setup

Before getting started, make sure your terminal is set to the proper location. In this case, it is set to `"~/Programming/python-for-ecologists/"`

In [1]:
# import packages
import pandas as pd

In [7]:
# load survey data

surveys_df = pd.read_csv("data/surveys.csv")

In [8]:
# view the first 5 rows
surveys_df.head()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
0,1,7,16,1977,2,NL,M,32.0,NaN
1,2,7,16,1977,3,NL,M,33.0,NaN
2,3,7,16,1977,2,DM,F,37.0,NaN
3,4,7,16,1977,7,DM,M,36.0,NaN
4,5,7,16,1977,3,DM,M,35.0,NaN

In [9]:
# view the last 5 rows
surveys_df.tail()

,record_id,month,day,year,plot_id,species_id,sex,hindfoot_length,weight
35544,35545,12,31,2002,15,AH,NaN,NaN,NaN
35545,35546,12,31,2002,15,AH,NaN,NaN,NaN
35546,35547,12,31,2002,10,RM,F,15.0,14.0
35547,35548,12,31,2002,7,DO,M,36.0,51.0
35548,35549,12,31,2002,5,NaN,NaN,NaN,NaN

In [11]:
# View the class type of the surveys_df objects
type(surveys_df)
    # note: "type()" is base python, which is why you didn't have to call a package first

pandas.core.frame.DataFrame

In [13]:
# to view the class types of each column, use dtypes
surveys_df.dtypes

record_id            int64
month                int64
day                  int64
year                 int64
plot_id              int64
species_id          object
sex                 object
hindfoot_length    float64
weight             float64
dtype: object

# Challenge - Dataframes

Using our DataFrame surveys_df, try out the following attributes & methods to see what they return: 
1. `surveys_df.columns`.

_Answer: Running `surveys_df.columns` returns an output of list with each column name, and the dtype attribute._


2. `surveys_df.shape`. Take note of the output of `shape` - what format does it return the shape of the DataFrame in?

_Answer: Running `surveys_df.shape` returns the number of rows and columns in a paired list: (rows, columns)_

3. `surveys_df.head()`. Also, what does `surveys_df.head(15)` do?

_Answer: Running `surveys_df.head(15)` returns the first 15 rows of the data frame._

4. `surveys_df.tail()`

_Answer: Running `surveys_df.tail()` returns the last 5 rows of the data frame._

# Calculating Statistics From Data In A Pandas DataFrame